[
  {
    "title": "Flavorites App",
    "github_link": [
      ["https://github.com/voldev8/recipes-api", "Backend"],
      ["https://github.com/voldev8/recipes-client", "Frontend"]
    ],
    "app_link": "https://flavorites.herokuapp.com/",
    "app_img": "./flavorites_screenshot.png",
    "app_img_alt": "Flavorites App",
    "app_description": [
      "The Flavorites App is a delightful platform that allows users to explore a catalog of recipes shared by fellow culinary enthusiasts. With a user-friendly interface, users can effortlessly search for recipes by name or tags, making it a breeze to find the perfect dish for any occasion.",
      "The recipe cards in Flavorites are interactive flip cards. On the front side, users are treated to a picture, recipe title, list of ingredients, and descriptive tags. A single click flips the card, revealing step-by-step instructions to guide users through the cooking process. When signed in, users can create their very own Flavorites catalog, curating their favorite recipes for easy access. Users also have the freedom to edit or remove their creations at any time.",
      "If users ever forget their password, they can simply click the \"forgot password\" link on the login page. A reset-password email will be sent to their inbox, providing a quick and easy solution to regain access to their account.",
      "Overall, the Flavorites App is a celebration of culinary creativity and a hub for sharing delicious recipes, making it a must-have for food enthusiasts and aspiring chefs alike."
    ],
    "tools": ["React", "MongoDB", "Express.js", "Node.js"]
  },
  {
    "title": "CS:GO tube App",
    "github_link": [["https://github.com/voldev8/cstube"]],
    "app_link": "https://cstube.herokuapp.com/",
    "app_img": "./csgotube_screenshot.png",
    "app_img_alt": "CS:GO_tube App",
    "app_description": [
      "The idea for this app was to consolidate CS:GO nade videos into a database. In this database, videos are organized by map, specific locations within each map and the type of utility demonstrated.",
      "With the help of CSGO_tube, you can swiftly search for videos and gain quick access to specific timestamps on YouTube, providing you with shortcuts to the most crucial moments in each tutorial. It gives user a shortcut to the specific timestamp on youtube CS utility usage videos. Users can search videos and save them into their favorite list. The web app also features the top 5 Twitch CS:GO live streams",
      "Elevate your CS:GO gameplay with the CSGO_tube"
    ],
    "tools": ["Django", "Django Template", "PostgreSQL", "Twitch API"]
  },
  {
    "title": "Noor Grill",
    "github_link": [["https://github.com/voldev8/noor_react"]],
    "app_link": "https://www.noorgrill.com/",
    "app_img": "./noorgrill_screenshot.png",
    "app_img_alt": "Noor Grill Webpage",
    "app_description": [
      "Restaurant webpage developed according to client's specifications Responsive design, dynamic menu display"
    ],
    "tools": ["React", "EmailJS"]
  },
  {
    "title": "Currently working on",
    "github_link": [["https://github.com/voldev8/jobHunt"]],
    "app_link": "/todo",
    "app_img": "./dwight.jpeg",
    "app_img_alt": "dwight the office meme",
    "app_description": [
      "The app that help users to explore, save, and apply for their favorite job opportunities with ease"
    ],
    "tools": [
      "Docker",
      "PostgreSQL",
      "Django",
      "React",
      "Nextjs",
      "TailwindCSS",
      "Typescript"
    ]
  }
]
